Análisis metros cúbicos de agua cobrados y los respectivos precios

In [1]:
#Importar librerías
import pandas as pd

In [4]:
#Leer archivo CSV
m3_df = pd.read_csv('../Archivos CSV/AGUA_COMBUSTIBLE.csv')

In [5]:
#Información del df
m3_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   FOLIO               10 non-null     object
 1   MES DE COBRO        10 non-null     object
 2   ANIO                10 non-null     int64
 3   DESDE               10 non-null     int64
 4   HASTA               10 non-null     int64
 5   M3 AGUA             10 non-null     int64
 6   PESO x M3           10 non-null     object
 7   AGUA INDIVIDUAL     10 non-null     float64
 8   M3 COMBUSTIBLE      10 non-null     int64
 9   PESO x COMBUSTIBLE  9 non-null      object
 10  COMBUSTIBLE         9 non-null      float64
 11  OTROS COBROS        1 non-null      float64
dtypes: float64(3), int64(5), object(4)
memory usage: 1.1+ KB

In [6]:
#Visualizar df
m3_df.head()

,FOLIO,MES DE COBRO,ANIO,DESDE,HASTA,M3 AGUA,PESO x M3,AGUA INDIVIDUAL,M3 COMBUSTIBLE,PESO x COMBUSTIBLE,COMBUSTIBLE,OTROS COBROS
0,13-3400,Junio,2023,73000,68000,5000,"1.331,800",6.659,5000,"4.840,688",24.203,NaN
1,14-3676,Julio,2023,77000,73000,4000,"1.345,500",5.382,4000,"5.055,088",20.220,NaN
2,15-3952,Agosto,2023,81000,77000,4000,"1.482,250",5.929,4000,"4.703,780",18.815,NaN
3,16-4228,Septiembre,2023,86000,81000,5000,"1.345,400",6.727,5000,"5.519,046",27.595,NaN
4,17-4504,Octubre,2023,91000,86000,5000,"1.419,000",7.905,5000,"4.761,364",23.087,NaN